tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "bash-completion"
brew "curl"
brew "git"
brew "git-lfs"
brew "hashcat"
brew "htop"
brew "iperf3"
brew "mas"
brew "masscan"
brew "nano"
brew "ncdu"
brew "nmap"
brew "node"
brew "putty"
brew "python"
brew "ruby"
brew "speedtest-cli"
brew "telnet"
brew "terminal-notifier"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "alfred"
cask "android-file-transfer"
cask "android-platform-tools"
cask "appcleaner"
cask "balenaetcher"
cask "bartender"
cask "battle-net"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "deluge"
cask "disk-inventory-x"
cask "dotnet-sdk"
cask "dropbox"
cask "dropshare"
cask "firefox"
cask "font-awesome-terminal-fonts"
cask "font-firacode-nerd-font"
cask "google-chrome"
cask "google-drive-file-stream"
cask "insomnia"
cask "intel-power-gadget"
cask "istat-menus"
cask "iterm2"
cask "java"
cask "karabiner-elements"
cask "keka"
cask "league-of-legends"
cask "macmediakeyforwarder"
cask "micro-snitch"
cask "microsoft-office"
cask "nordvpn"
cask "rambox"
cask "sdformatter"
cask "snagit"
cask "spotify"
cask "sqlectron"
cask "steam"
cask "timemachineeditor"
cask "tor-browser"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "wireshark"
mas "at.EternalStorms.Yoink", id: 457622435
mas "com.apple.dt.Xcode", id: 497799835
mas "com.blackmagic-design.DiskSpeedTest", id: 425264550
mas "com.crowdcafe.windowmagnet", id: 441258766
mas "com.if.Amphetamine", id: 937984704
mas "com.iwaxx.LanScan", id: 472226235
mas "com.lastpass.LastPass", id: 926036361
mas "com.microsoft.rdc.macos", id: 1295203466
mas "com.robinlu.mac.Tooth-Fairy", id: 1191449274
mas "nz.co.pixeleyes.AutoMounter", id: 1160435653
