tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "curl"
brew "git"
brew "htop"
brew "iperf3"
brew "mas"
brew "nano"
brew "ncdu"
brew "nmap"
brew "node"
brew "python"
brew "rbenv"
brew "speedtest-cli"
brew "telnet"
brew "terminal-notifier"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
mas "Amphetamine", id: 937984704
mas "AutoMounter", id: 1160435653
mas "Blackmagic Disk Speed Test", id: 425264550
mas "LanScan", id: 472226235
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "ToothFairy", id: 1191449274
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435
